{
  "name": "Artur Ostrega",
  "profession": "Web developer",
  "contact": [
    "artur@ostrega.me",
    "773/934-5970",
    "5303 N Delphia<br />Chicago, IL 60656",
    "http://artur.ostrega.me"
  ],
  "sections": [
    {
      "name": "Skills",
      "content": [
        {
          "name": "Software development",
          "details": [
            "10 years of hobbyist experience before starting professional career.",
            "Strongly value pragmatic approach to problems, solid and extensible architecture, behavior/test-driven development, security by design, clean code, DRY code, KISS, agile software development, convention over configuration, decentralized version control (Git, Mercurial) and open source software stacks.",
            "Proficient with JavaScript, CoffeeScript, Ruby, Python, the UNIX shell and Vim.",
            "Some experience with Go, Lua, Lisp, C, C++, ActionScript and PHP."
          ]
        }, {
          "name": "Front-end web development",
          "details": [
            "Strict XHTML and HTML5 (semantic web, audio, video, contenteditable, canvas, WebSocket, web storage, geolocation, native drag and drop, file API)",
            "CSS3 (responsive design, Sass, LESS, Twitter Bootstrap)",
            "JavaScript (<em>The Good Parts</em>, progressive enhancement, AJAX, asm.js, CoffeeScript, jQuery, AngularJS, Ember.js, Modernizr, Firebase, Underscore.js, rangy, Paper.js, Jasmine, QUnit)"
          ]
        }, {
          "name": "Back-end web development",
          "details": [
            "Ruby (Ruby on Rails, Sinatra, Rspec, MiniTest, Test::Unit, Capybara, Guard, Factory Girl, RubyGems)",
            "JavaScript (Node.js, npm, CoffeeScript, Socket.IO, Jasmine, QUnit, npm)",
            "Python (Flask, SQLAlchemy, Elixir, unittest, pip)",
            "Heroku, OAuth, RESTful JSON/XML API design"
          ]
        }, {
          "name": "Design",
          "details": [
            "Fundamental visual design principles, user experience design, typography",
            "Perfectionist attention to detail."
          ]
        }
      ]
    }, {
      "name": "Experience",
      "content": [
        {
          "name": "Freelance web development",
          "date": ["February 2013", "present"],
          "details": [
            "303 Velocity &mdash; Built a script with Ruby and Mechanize that scrapes all Craigslist mobile software development job postings in the world and compiles them into a spreadsheet.",
            "Pixabit &mdash; Worked on Dark Age Wars' mature jQuery-heavy front-end to optimize code, fix bugs, implement features and build new parts of the interface.",
            "Nuflection &mdash; Created a Ruby on Rails-based web app with a Test::Unit test suite featuring a custom member registration system and scripted HTML5 Video."
          ]
        }, {
          "name": "Entrepreneurial web development",
          "date": ["August 2012", "January 2013"],
          "details": [
            "Tin Bull &mdash; Anonymous discussion board inspired by reddit and 2channel. Features an innovative throwaway pseudonymity system and a responsive design. Made with Ruby on Rails and has an Rspec/Capybara test suite. http://tinbull.com",
            "Piki &mdash; Cloud-based personal wiki application designed to be as comfortable and intuitive as possible. Back-end made with Python, Flask and Elixir; dynamic front-end and wiki editor made with CoffeeScript, HTML5 ContentEditable, jQuery and rangy. http://piki.heroku.com"
          ]
        }
      ]
    }, {
      "name": "Education",
      "content": [
        {
          "name": "Triton College",
          "date": [2007, 2008]
        }
      ]
    }
  ]
}

