{
  "name": "Artur Ostrega",
  "profession": "Full-stack web developer",
  "contact": [
    "<u>skoofoo@gmail.com</u>",
    "(773) 934-5970",
    "2803 W Lawrence Ave, Chicago, IL 60625",
    "<u>http://skofo.github.io</u>"
  ],
  "sections": [
    {
      "name": "Professional experience",
      "subsections": [
        {
          "name": "Andover Daskala",
          "date": "April 2013 &ndash; August 2013",
          "details": [
            "Full-stack developer part of a small team building a responsive HTML5 student assessment platform.",
            "Worked with Ruby on Rails and Rspec for the backend and Ember, Bootstrap and QUnit for the frontend.",
            "Created complex data management tools with changing requirements and set up automated testing."
          ]
        }, {
          "name": "Pixabit",
          "date": "January 2013 &ndash; April 2013",
          "details": [
            "Worked remotely on Dark Age Wars' mature jQuery frontend to optimize code, fix bugs, implement features and build new interface components."
          ]
        }
      ]
    }, {
      "name": "Projects",
      "subsections": [
        {
          "name": "Yeah",
          "details": [
            "An opinionated Ruby video game framework.",
            "Meant to bring modern software development ideas to the world of video games - prioritizing rapid development, code flexibility and developer happiness over raw performance.",
            "<u>https://github.com/skofo/yeah</u>"
          ]
        }, {
          "name": "Tin Bull",
          "details": [
            "Anonymous discussion board inspired by reddit and 2channel and made with Ruby on Rails.",
            "Features an innovative throwaway pseudonymity system and a responsive design.",
            "<u>http://tinbull.com</u>, <u>http://skofo.github.io/blog/tinbull-retrospective</u>"
          ]
        }, {
          "name": "Piki",
          "details": [
            "Cloud-based personal wiki application designed to be as comfortable and intuitive as possible.",
            "Backend made with Python, Flask and Elixir; frontend and wiki editor made with CoffeeScript, HTML5 ContentEditable, jQuery and rangy.",
            "<u>http://piki.heroku.com</u>, <u>http://skofo.github.io/blog/piki-retrospective</u>"
          ]
        }
      ]
    }, {
      "name": "Skills",
      "subsections": [
        {
          "name": "Software development",
          "details": [
            "Value pragmatic approach to problems, behavior-driven development, security by design, simple and flexible code, convention over configuration, decentralized version control and open source software stacks.",
            "Proficient with JavaScript, CoffeeScript, Ruby, Python, the UNIX shell and Vim.",
            "10 years of hobbyist experience before starting professional career."
          ]
        }, {
          "name": "Back-end web development",
          "details": [
            "Ruby (Ruby on Rails, Sinatra, Rspec, MiniTest, Test::Unit, Capybara, Shoulda, Guard, Spork, Factory Girl, RubyGems, RVM)",
            "JavaScript (CoffeeScript, Jasmine, QUnit, Meteor, Node.js, npm)",
            "Python (Flask, SQLAlchemy, Elixir, unittest, pip, virtualenv)",
            "Heroku, SQL, FTP, OAuth, RESTful JSON/XML API design"
          ]
        }, {
          "name": "Front-end web development",
          "details": [
            "HTML5 (semantic web, audio, video, contenteditable, canvas, WebSocket, web storage, geolocation, native drag and drop, file API) and Strict XHTML",
            "CSS3 (responsive design, Twitter Bootstrap, Sass, LESS)",
            "JavaScript (<em>The Good Parts</em>, progressive enhancement, AJAX, asm.js, CoffeeScript, jQuery, Ember.js, AngularJS, Handlebars, Modernizr, Underscore.js, Paper.js, Jasmine, QUnit)",
            "Some experience with visual design principles, user experience design, and typography."
          ]
        }
      ]
    }
  ]
}
